import React, {useState,useEffect} from 'react';
import axios from 'axios';
//import {API_BASE_URL} from '../../constants/apiContants';
import {
    BrowserRouter as Router,
    // Switch,
    // Route,
    // Link,
    // useRouteMatch,
    useParams,
    withRouter
  } from "react-router-dom";
import './bookView.css';


function BookView(props) {
    let { bookId } = useParams();

    //const bookId= props.match.params.id;
    console.log(bookId);
    console.log(bookId.name);
    const [state , setState] = useState({
        //bookId:props.match.params.id,
    })
    console.log(useParams);
    console.log(props);
    //const {bookId} = props.match.params;
    useEffect(() => {
    if (props.match.params.bookId) {       
        axios.get('/book/' + props.match.params.bookId)
            .then(response => {
            // console.log(response);
              setState({ bookId: response.data });
            });
            
    }
    }, []);
    console.log(props.match.params.bookId);
    



    return(
        
        <div className="container-fluid col-sm-8 rTOl text-right " >
            <div className="row color1 my-2 mx-auto">
                <div className="col-sm-3 ">
                    <img src="Whispers in the Static.jpeg" className="img-fluid" alt="" />
                </div>
                <div className="mt-auto">
                 <table className=" table table-hover text-right" >
                  <tbody >
                    <tr >
                        <th >
                            نام کتاب
                        </th>
                        <td>
                            بار دیگر شهری که دوست می داشتم
                        </td>
                    </tr>
                    <tr>
                        <th>
                            نام نویسنده
                        </th>
                        <td>
                            نادر ابراهیمی
                        </td>
                    </tr>
                    <tr>
                        <th>
                            نام ناشر
                        </th>
                        <td>
                            نشر
                        </td>
                    </tr>
                  </tbody>
                </table>
    
    
                </div>
                
            </div>
            <nav className="navbar navbar-expand-sm navbar-light sticky-top color3">  
                <ul className="navbar-nav">
                    <li className="nav-item">
                        <a className="nav-link" href="#bookSummary">خلاصه</a>
                    </li>
                    <li className="nav-item">
                        <a className="nav-link" href="#bookCriticism">نقد</a>
                     </li>
    
                </ul>
            </nav>

            <div id="bookSummary" className="color1 p-2">
                <br></br>
                <h3>خلاصه کتاب {bookId.name}</h3>
                <br></br>
                <p>

                بار دیگر شهری که دوست می‌داشتم اثر ماندگار دیگری از نادر ابراهیمی است که در سال ۱۳۱۵ در تهران متولد شد و در ۷۲ سالگی بر اثر بیماری درگذشت. از این داستان‌نویس معاصر ایرانی بیش از نود کتاب به یادگار مانده است که از معروف‌ترین آنها می‌توان به یک عاشقانهٔ آرام، خانه‌ای برای شب، چهل نامهٔ کوتاه به همسرم اشاره کرد.

وی علاوه بر داستان‌نویسی، در زمینه‌های فیلم‌سازی، ترانه‌سرایی، ترجمه و روزنامه‌نگاری نیز فعالیت کرده‌ و نویسندهٔ یک مجموعهٔ هفت‌جلدی به نام «آتش بدون دود» است که فیلم آن نیز ساخته شده است.
                    <br></br>
                </p>
            </div>
            <div id="bookCriticism" className="color1 p-2">
                <br></br>
                <h3>نقد کتاب {bookId.name}</h3>
                <br></br>
باشیم. برای عادت های جدید وقت بگذاریم (حتی وقتی زندگی با ما سر ناسازگاری دارد). محیط مان را طوری طراحی کنیم که در آن موفقیت آسان تر باشد. تغییرات کوچک و ساده ای ایجاد کنیم که نتایج بزرگی به همراه دارند. و مهم تر از همه، چگونه این ایده ها را در زندگی واقعی مان به اجرا در آوریم.

معرفی کتاب عادت‌های اتمی
جیمز کلیر در کتاب عادت‌های اتمی یک راه ساده و اثبات شده برای ایجاد عادات خوب و شکستن عادات بد معرفی کرده است. اساس این راهکار چنین است: تغییرات کوچک، نتایج قابل توجه دارند.

کتاب عادت‌های اتمی را می‌توانید با ترجمه‌ای روان و خواندنی از هادی بهمنی، مطالعه کنید. 

درباره‌ی کتاب عادت‌های اتمی
جیمز کلیر در کتاب عادت‌های اتمی به تاثیر تغییرات کوچک در زندگی پرداخته است. چرایی این تاثیرات را توضیح داده، گام‌های ساده‌ای برای ساختن عادات بهتر معرفی کرده و در نهایت راز ماندگاری نتایج مثبت حاصل از تغییرات کوچک در زندگی را برای خوانندگانش بیان کرده است. کتاب عادت‌های اتمی، با سبکی جالب و روان، به ما یاد می دهد که چگونه با شناخت عادت‌های کوچک و مدیریت این عادت‌ها، هر روز یک درصد بهتر شویم. هر روز یک درصد بهتر شدن، معادل سالی ۳۷برابر بهتر شدن است. به قول جیمز کلیر، همین رفتارها و عادت‌های کوچک است که تعیین می‌کند ۵ سال بعد کجا هستیم و چقدر موفق شده‌ایم یا شکست خورده‌ایم!

درس‌هایی که از کتاب عادت‌های اتمی یاد می‌گیریم: سیستمی طراحی کنیم که هر روز ۱ درصد بهتر شویم. عادت های بد را بشکنیم و به عادت های خوب بچسبیم! از اشتباهاتی اجتناب کنیم که اغلب افراد، موقع تغییر عادات شان مرتکب می شوند. بر نبودِ انگیزه و اراده غلبه کنیم. هویت قوی تری را توسعه دهیم و به خودمان اعتقاد داشته باشیم. برای عادت های جدید وقت بگذاریم (حتی وقتی زندگی با ما سر ناسازگاری دارد). محیط مان را طوری طراحی کنیم که در آن موفقیت آسان تر باشد. تغییرات کوچک و ساده ای ایجاد کنیم که نتایج بزرگی به همراه دارند. و مهم تر از همه، چگونه این ایده ها را در زندگی واقعی مان به اجرا در آوریم.

کتاب عادت‌های اتمی را به چه کسانی پیشنهاد می‌کنیم
مطالعه‌ی کتاب عادت‌های اتمی برای همه مفید است. با این‌حال اگر به دنبال روشی خوب برای ترک عادت‌های بد می‌گردید، کتاب عادت‌های اتمی را بخوانید. 

جملاتی از کتاب عادت‌های اتمی
عادت‌ها غالبا هیچ تفاوتی ایجاد نمی‌کنند، تا اینکه از یک حد مرزی عبور کنیم و سطح جدیدی از عملکرد گشوده شود. در مراحل اولیه و میانی هر اقدامی، غالبا دره‌های ناامیدی وجود دارند. انتظار دارید که پیشرفتتان به‌صورت خطی باشد و وقتی می‌بینید تلاش‌هایتان ثمرهٔ خود را در چند روز، هفته یا ماه اول نشان نمی‌دهند، ناامید می‌شوید. حس می‌کنید که قرار نیست به جای خاصی برسید. این نشانه‌ای از هرگونه پروسهٔ ترکیب شدن است: قدرتمندترین نتایج با تاخیر ظاهر می‌شوند.

این یکی از دلایل اصلی برای دشواری‌های ایجاد عادت‌های ماندگار است. افراد تغییرات کوچکی ایجاد می‌کنند، نمی‌توانند نتیجهٔ محسوس را ببینند و تصمیم به توقف آن می‌گیرند. با خود فکر می‌کنند که «من این ماه هر روز دویدم، پس چرا هیچ تغییری در بدنم نمی‌ببینم؟» وقتی چنین تفکر غالب شود، خیلی راحت عادت‌های خوبتان را کنار می‌گذارید. اما به‌منظور ایجاد تفاوت‌های معنادار، عادات باید به‌اندازهٔ کافی پابرجا بمانند تا قله فتح شود – که آن را «قلهٔ پتانسیل پنهان» می‌نامم.

اگر برای ایجاد یک عادت خوب یا شکستن یک عادت بد، به سختی تقلا می‌کنید، بدین معنا نیست که توانایی بهبود را از دست داده‌اید. غالبا به این خاطر است که هنوز «قلهٔ پتانسیل پنهان» را فتح نکرده‌اید.  وقتی بالاخره «قلهٔ پتانسیل پنهان» را فتح کردید، افراد آن را یک موفقیت یک‌شبه خواهند نامید!معرفی کتاب عادت‌های اتمی
جیمز کلیر در کتاب عادت‌های اتمی یک راه ساده و اثبات شده برای ایجاد عادات خوب و شکستن عادات بد معرفی کرده است. اساس این راهکار چنین است: تغییرات کوچک، نتایج قابل توجه دارند.

کتاب عادت‌های اتمی را می‌توانید با ترجمه‌ای روان و خواندنی از هادی بهمنی، مطالعه کنید. 

درباره‌ی کتاب عادت‌های اتمی
جیمز کلیر در کتاب عادت‌های اتمی به تاثیر تغییرات کوچک در زندگی پرداخته است. چرایی این تاثیرات را توضیح داده، گام‌های ساده‌ای برای ساختن عادات بهتر معرفی کرده و در نهایت راز ماندگاری نتایج مثبت حاصل از تغییرات کوچک در زندگی را برای خوانندگانش بیان کرده است. کتاب عادت‌های اتمی، با سبکی جالب و روان، به ما یاد می دهد که چگونه با شناخت عادت‌های کوچک و مدیریت این عادت‌ها، هر روز یک درصد بهتر شویم. هر روز یک درصد بهتر شدن، معادل سالی ۳۷برابر بهتر شدن است. به قول جیمز کلیر، همین رفتارها و عادت‌های کوچک است که تعیین می‌کند ۵ سال بعد کجا هستیم و چقدر موفق شده‌ایم یا شکست خورده‌ایم!

درس‌هایی که از کتاب عادت‌های اتمی یاد می‌گیریم: سیستمی طراحی کنیم که هر روز ۱ درصد بهتر شویم. عادت های بد را بشکنیم و به عادت های خوب بچسبیم! از اشتباهاتی اجتناب کنیم که اغلب افراد، موقع تغییر عادات شان مرتکب می شوند. بر نبودِ انگیزه و اراده غلبه کنیم. هویت قوی تری را توسعه دهیم و به خودمان اعتقاد داشته باشیم. برای عادت های جدید وقت بگذاریم (حتی وقتی زندگی با ما سر ناسازگاری دارد). محیط مان را طوری طراحی کنیم که در آن موفقیت آسان تر باشد. تغییرات کوچک و ساده ای ایجاد کنیم که نتایج بزرگی به همراه دارند. و مهم تر از همه، چگونه این ایده ها را در زندگی واقعی مان به اجرا در آوریم.

کتاب عادت‌های اتمی را به چه کسانی پیشنهاد می‌کنیم
مطالعه‌ی کتاب عادت‌های اتمی برای همه مفید است. با این‌حال اگر به دنبال روشی خوب برای ترک عادت‌های بد می‌گردید، کتاب عادت‌های اتمی را بخوانید. 

جملاتی از کتاب عادت‌های اتمی
عادت‌ها غالبا هیچ تفاوتی ایجاد نمی‌کنند، تا اینکه از یک حد مرزی عبور کنیم و سطح جدیدی از عملکرد گشوده شود. در مراحل اولیه و میانی هر اقدامی، غالبا دره‌های ناامیدی وجود دارند. انتظار دارید که پیشرفتتان به‌صورت خطی باشد و وقتی می‌بینید تلاش‌هایتان ثمرهٔ خود را در چند روز، هفته یا ماه اول نشان نمی‌دهند، ناامید می‌شوید. حس می‌کنید که قرار نیست به جای خاصی برسید. این نشانه‌ای از هرگونه پروسهٔ ترکیب شدن است: قدرتمندترین نتایج با تاخیر ظاهر می‌شوند.

این یکی از دلایل اصلی برای دشواری‌های ایجاد عادت‌های ماندگار است. افراد تغییرات کوچکی ایجاد می‌کنند، نمی‌توانند نتیجهٔ محسوس را ببینند و تصمیم به توقف آن می‌گیرند. با خود فکر می‌کنند که «من این ماه هر روز دویدم، پس چرا هیچ تغییری در بدنم نمی‌ببینم؟» وقتی چنین تفکر غالب شود، خیلی راحت عادت‌های خوبتان را کنار می‌گذارید. اما به‌منظور ایجاد تفاوت‌های معنادار، عادات باید به‌اندازهٔ کافی پابرجا بمانند تا قله فتح شود – که آن را «قلهٔ پتانسیل پنهان» می‌نامم.

اگر برای ایجاد یک عادت خوب یا شکستن یک عادت بد، به سختی تقلا می‌کنید، بدین معنا نیست که توانایی بهبود را از دست داده‌اید. غالبا به این خاطر است که هنوز «قلهٔ پتانسیل پنهان» را فتح نکرده‌اید.  وقتی بالاخره «قلهٔ پتانسیل پنهان» را فتح کردید، افراد آن را یک موفقیت یک‌شبه خواهند نامید!

            </div>






        </div>





    )








}


export default withRouter(BookView);